docs/measurements/2026-05-19/stress/b-io-glassmkr-val-asus-z12pp.fio.txt
measurement-io: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=64
fio-3.39
Starting 1 process

measurement-io: (groupid=0, jobs=1): err= 0: pid=3891554: Thu May 21 08:49:12 2026
  read: IOPS=45.7k, BW=179MiB/s (187MB/s)(105GiB/600001msec)
    slat (nsec): min=1654, max=2086.0k, avg=21155.53, stdev=8237.42
    clat (usec): min=2, max=4591, avg=1377.81, stdev=194.45
     lat (usec): min=24, max=4614, avg=1398.97, stdev=197.37
    clat percentiles (usec):
     |  1.00th=[  498],  5.00th=[  938], 10.00th=[ 1221], 20.00th=[ 1352],
     | 30.00th=[ 1385], 40.00th=[ 1401], 50.00th=[ 1434], 60.00th=[ 1450],
     | 70.00th=[ 1467], 80.00th=[ 1483], 90.00th=[ 1516], 95.00th=[ 1532],
     | 99.00th=[ 1565], 99.50th=[ 1582], 99.90th=[ 1631], 99.95th=[ 1680],
     | 99.99th=[ 2212]
   bw (  KiB/s): min=169568, max=317968, per=100.00%, avg=183001.89, stdev=26341.51, samples=1199
   iops        : min=42392, max=79492, avg=45750.49, stdev=6585.38, samples=1199
  lat (usec)   : 4=0.01%, 50=0.01%, 100=0.01%, 250=0.01%, 500=1.03%
  lat (usec)   : 750=2.16%, 1000=2.56%
  lat (msec)   : 2=94.24%, 4=0.01%, 10=0.01%
  cpu          : usr=2.71%, sys=97.25%, ctx=3319, majf=0, minf=76
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwts: total=27443330,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64

Run status group 0 (all jobs):
   READ: bw=179MiB/s (187MB/s), 179MiB/s-179MiB/s (187MB/s-187MB/s), io=105GiB (112GB), run=600001-600001msec