docs/measurements/2026-05-19/stress/b-io-glassmkr-val-gigabyte-mc12le.fio.txt
measurement-io: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=64
fio-3.39
Starting 1 process

measurement-io: (groupid=0, jobs=1): err= 0: pid=93546: Thu May 21 12:49:07 2026
  read: IOPS=9647, BW=37.7MiB/s (39.5MB/s)(22.1GiB/600001msec)
    slat (usec): min=31, max=11745, avg=102.21, stdev=13.43
    clat (nsec): min=1493, max=246673k, avg=6530339.79, stdev=2434281.93
     lat (usec): min=103, max=246711, avg=6632.55, stdev=2434.05
    clat percentiles (msec):
     |  1.00th=[    7],  5.00th=[    7], 10.00th=[    7], 20.00th=[    7],
     | 30.00th=[    7], 40.00th=[    7], 50.00th=[    7], 60.00th=[    7],
     | 70.00th=[    7], 80.00th=[    7], 90.00th=[    7], 95.00th=[    7],
     | 99.00th=[    7], 99.50th=[    7], 99.90th=[    8], 99.95th=[   10],
     | 99.99th=[  224]
   bw (  KiB/s): min=21819, max=41272, per=100.00%, avg=38608.44, stdev=1445.67, samples=1199
   iops        : min= 5454, max=10318, avg=9652.08, stdev=361.42, samples=1199
  lat (usec)   : 2=0.01%, 250=0.01%, 500=0.01%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=99.95%, 20=0.03%, 50=0.01%
  lat (msec)   : 250=0.01%
  cpu          : usr=1.02%, sys=10.09%, ctx=5789347, majf=0, minf=74
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwts: total=5788770,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64

Run status group 0 (all jobs):
   READ: bw=37.7MiB/s (39.5MB/s), 37.7MiB/s-37.7MiB/s (39.5MB/s-39.5MB/s), io=22.1GiB (23.7GB), run=600001-600001msec

Disk stats (read/write):
    md127: ios=5787753/2381, sectors=46302024/20056, merge=0/0, ticks=548836/80, in_queue=548916, util=91.52%, aggrios=2894385/1122, aggsectors=23155080/10028, aggrmerge=0/135, aggrticks=282576/188, aggrin_queue=282841, aggrutil=47.29%
  sdb: ios=2894418/988, sectors=23155344/9136, merge=0/103, ticks=289460/176, in_queue=289713, util=47.29%
  sda: ios=2894352/1256, sectors=23154816/10920, merge=0/168, ticks=275692/200, in_queue=275969, util=45.25%