docs/measurements/2026-05-19/stress/b-io-glassmkr-val-supermicro-x12qch-control.fio.txt
measurement-io: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=64
fio-3.28
Starting 1 process
measurement-io: Laying out IO file (1 file / 2048MiB)

measurement-io: (groupid=0, jobs=1): err= 0: pid=31320: Thu May 21 12:38:59 2026
  read: IOPS=11.9k, BW=46.5MiB/s (48.8MB/s)(27.3GiB/600001msec)
    slat (usec): min=11, max=1562, avg=82.43, stdev=29.30
    clat (nsec): min=1472, max=226687k, avg=5289826.07, stdev=2169273.57
     lat (usec): min=68, max=226738, avg=5372.39, stdev=2169.38
    clat percentiles (msec):
     |  1.00th=[    5],  5.00th=[    5], 10.00th=[    5], 20.00th=[    6],
     | 30.00th=[    6], 40.00th=[    6], 50.00th=[    6], 60.00th=[    6],
     | 70.00th=[    6], 80.00th=[    6], 90.00th=[    6], 95.00th=[    6],
     | 99.00th=[    6], 99.50th=[    6], 99.90th=[    7], 99.95th=[    7],
     | 99.99th=[  203]
   bw (  KiB/s): min=29402, max=53976, per=100.00%, avg=47707.90, stdev=1763.47, samples=1199
   iops        : min= 7350, max=13494, avg=11926.76, stdev=440.88, samples=1199
  lat (usec)   : 2=0.01%, 100=0.01%, 250=0.01%, 500=0.01%, 750=0.01%
  lat (usec)   : 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.09%, 10=99.90%, 250=0.01%
  cpu          : usr=1.76%, sys=6.69%, ctx=7146470, majf=0, minf=89
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwts: total=7146313,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64

Run status group 0 (all jobs):
   READ: bw=46.5MiB/s (48.8MB/s), 46.5MiB/s-46.5MiB/s (48.8MB/s-48.8MB/s), io=27.3GiB (29.3GB), run=600001-600001msec

Disk stats (read/write):
    md127: ios=7145581/1912, merge=0/0, ticks=554004/160, in_queue=554164, util=99.69%, aggrios=3573156/2440, aggrmerge=0/408, aggrticks=278603/200, aggrin_queue=278804, aggrutil=99.69%
  nvme1n1: ios=302/2440, merge=0/409, ticks=27/212, in_queue=239, util=0.30%
  nvme0n1: ios=7146011/2441, merge=0/408, ticks=557180/189, in_queue=557370, util=99.69%